; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	thermograph1 - mode
	image0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star9 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation8 - direction
	Star6 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star4)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 image0)
	(have_image Star12 thermograph1)
	(have_image Planet13 image0)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 thermograph1)
	(have_image Star16 image0)
	(have_image Planet17 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation8)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 groundstation8)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon15 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 9
5. (take_image satellite1 phenomenon15 instrument2 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon14 instrument2 image0)
   added: (have_image phenomenon14 image0)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon10 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon10 instrument2 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 3 of 9
10. (turn_to satellite1 planet11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet11)
   goals met: 3 of 9
11. (take_image satellite1 planet11 instrument2 image0)
   added: (have_image planet11 image0)
   goals met: 4 of 9
12. (turn_to satellite1 planet13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet13)
   goals met: 4 of 9
13. (take_image satellite1 planet13 instrument2 image0)
   added: (have_image planet13 image0)
   goals met: 5 of 9
14. (turn_to satellite1 planet17 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet17)
   goals met: 5 of 9
15. (take_image satellite1 planet17 instrument2 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 6 of 9
16. (turn_to satellite1 star12 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star12)
   goals met: 6 of 9
17. (take_image satellite1 star12 instrument2 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 7 of 9
18. (turn_to satellite1 star16 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star16)
   goals met: 7 of 9
19. (take_image satellite1 star16 instrument2 image0)
   added: (have_image star16 image0)
   goals met: 8 of 9
20. (turn_to satellite1 star4 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star4)
   goals met: 9 of 9
